-- phpMyAdmin SQL Dump
-- version 4.9.3
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost:8889
-- 生成日時: 2022 年 12 月 05 日 15:26
-- サーバのバージョン： 5.7.26
-- PHP のバージョン: 7.4.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `duty_shuffle`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `history`
--



--
-- テーブルのデータのダンプ `history`
--



-- --------------------------------------------------------

--
-- テーブルの構造 `member`
--



--
-- テーブルのデータのダンプ `member`
--

INSERT INTO `member` (`id`, `family_name`, `given_name`, `kana_name`, `archive`) VALUES
(1, 'テスト', '太郎', 'てすとたろう', 1),
(2, 'テスト', '花子', 'てすとはなこ', 1),
(3, '釘子', '津佳冴', 'くぎこつかさ', 0),
(4, '長谷川', '異風', 'はせがわいふう', 0),
(5, '樋口', '伊吹', 'ひぐちいぶき', 0),
(6, '小泉', '俊一', 'こいずみしゅんいち', 0),
(7, '北川', '優斗', 'きたがわゆうと', 0),
(8, '小股', '晄', 'おまたあき', 0),
(9, '田鹿', '蒼史', 'たじかそうじ', 0),
(10, '芦生', '浩明', 'あしおひろあき', 0),
(11, '高宮城', '誉有治', 'たかみやぎようき', 0),
(12, '朴', '清', 'ぼくきよし', 0),
(13, '西加治工', '祐樹', 'にしかじくゆうき', 0),
(14, '雉子谷', '茂夫', 'きじだにしげお', 0),
(15, '渡谷', '身志', 'わたりやみり', 0),
(16, '室石', '遙摯', 'むろいしはると', 0),
(17, '塩足', '壱', 'しおたりいち', 0),
(18, '筒屋', '厳春', 'つつやみねはる', 0),
(19, '日陰茂井', '昊', 'ひかげもいそら', 0),
(20, '精廬', '里備', 'とぐろさとはる', 0),
(21, '喜美候部', '智絃	', 'きみこうべちづる', 0),
(22, '竹乘', '成也', 'たけのりなりや', 0),
(23, '安達', '城灯', 'あだちきと', 0),
(24, '森田', '悠翔', 'もりたはると', 0),
(25, '矢野', '英一', 'やのえいいち', 0),
(26, '誉田', '和樹', 'ほまれだかずき', 0),
(27, '数', '瑛斗', 'かずえいと', 0);

-- --------------------------------------------------------

--
-- テーブルの構造 `member_option`
--



-- --------------------------------------------------------

--
-- テーブルの構造 `shuffle_option`
--



-- --------------------------------------------------------

--
-- テーブルの構造 `work`
--



--
-- テーブルのデータのダンプ `work`
--

INSERT INTO `work` (`id`, `name`, `multiple`, `archive`) VALUES
(1, 'リーダー', 1, 0),
(2, 'ハンディモップ', 1, 0),
(3, 'アクリルボード', 1, 0),
(4, 'ガラス拭き', 1, 0),
(5, '除菌シート', 1, 0),
(6, '窓の出っ張り', 1, 0),
(7, 'コロコロ', 1, 0),
(8, 'アルコール拭き', 1, 0),
(9, '水拭き', 1, 0),
(10, 'ゴミ捨て', 1, 0),
(11, '掃除機', 1, 1);

-- --------------------------------------------------------

--
-- テーブルの構造 `_prisma_migrations`
--



--
-- テーブルのデータのダンプ `_prisma_migrations`
--



--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `history`
--


--
-- テーブルのインデックス `member`
--


--
-- テーブルのインデックス `member_option`
--


--
-- テーブルのインデックス `shuffle_option`
--

--
-- テーブルのインデックス `work`
--


--
-- テーブルのインデックス `_prisma_migrations`
--


--
-- ダンプしたテーブルのAUTO_INCREMENT
--

--
-- テーブルのAUTO_INCREMENT `history`
--


--
-- テーブルのAUTO_INCREMENT `member`
--


--
-- テーブルのAUTO_INCREMENT `member_option`
--


--
-- テーブルのAUTO_INCREMENT `shuffle_option`
--


--
-- テーブルのAUTO_INCREMENT `work`
--


--
-- ダンプしたテーブルの制約
--

--
-- テーブルの制約 `history`
--


--
-- テーブルの制約 `member_option`
--


/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
